import requests


valute_lod = {
    "Австралійський долар":"AUD",
    "Канадський долар":"CAD",
    "Юань":"CNY",
    "Чеська крона":"CZK",
    "Данська крона":"DKK",
    "Гонконгівський долар":"HKD",
    "Форинт":"HUF",
    "Індійська рупія":"INR",
    "Рупія":"IDR",
    "Новий ізраїльський шекель":"ILS",
    "Єна":"JPY",
    "Теньге":"KZT",
    "Вона":"KRW",
    "Мексиканське песо":"MXN",
    "Молдовський лей":"MDL",
    "Новозеландський долар":"NZD",
    "Норвезька крона":"NOK",
    "Російський рубль":"RUB",
    "Сінгапурський долар":"SGD",
    "Ренд":"ZAR",
    "Шведська крона":"SEK",
    "Швейцарський франк":"CHF",
    "Єгипетський фунт":"EGP",
    "Фунт стерлінгів":"GBP",
    "Долар США":"USD",
    "Білоруський рубль":"BYN",
    "Азербайджанський манат":"AZN",
    "Румунський лей":"RON",
    "Турецька ліра":"TRY",
    "СПЗ (спеціальні права запозичення)":"XDR",
    "Болгарський лев":"BGN",
    "Євро":"EUR",
    "Злотий":"PLN",
    "Алжирський динар":"DZD",
    "Така":"BDT",
    "Вірменський драм":"AMD",
    "Домініканське песо":"DOP",
    "Іранський ріал":"IRR",
    "Іракський динар":"IQD",
    "Сом":"KGS",
    "Ліванський фунт":"LBP",
    "Лівійський динар":"LYD",
    "Малайзійський ринггіт":"MYR",
    "Марокканський дирхам":"MAD",
    "Пакистанська рупія":"PKR",
    "Саудівський ріял":"SAR",
    "Донг":"VND",
    "Бат":"THB",
    "Дирхам ОАЕ":"AED",
    "Туніський динар":"TND",
    "Узбецький сум":"UZS",
    "Новий тайванський долар":"TWD",
    "Туркменський новий манат":"TMT",
    "Сербський динар":"RSD",
    "Сомоні":"TJS",
    "Ларі":"GEL",
    "Бразильський реал":"BRL",
    "Золото":"XAU",
    "Срібло":"XAG",
    "Платина":"XPT",
    "Паладій":"XPD",

}



valcode = input("Введіть валюту:")
valdata = input("Введіть дату:")



if valcode in valute_lod:
    valcode = valute_lod[valcode]


response = requests.get(
    f"https://bank.gov.ua/NBUStatService/v1/statdirectory/exchange?valcode={valcode}&date={valdata}&json")

data = response.json()

print(data)
print(data[0]["rate"])


























